export const validexpression = {
    Password: "^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[@#$%^&+=])(?=\\S+$).{8,16}$",
    CURP: "^[A-Z]{4}[0-9]{6}[HM][A-Z]{5}[0-9]{2}$",
    RFC: "^[A-Z]{4}[0-9]{6}[A-Z0-9]{3}$",
    Email: "^[A-Za-z0-9+_.-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,}$",
    Nombres:"^([A-Za-zÑñÁáÉéÍíÓóÚú ]+['\-]{0,1}[A-Za-zÑñÁáÉéÍíÓóÚú ]+)(\s+([A-Za-zÑñÁáÉéÍíÓóÚú ]+['\-]{0,1}[A-Za-zÑñÁáÉéÍíÓóÚú ]+))*$",
    Apellidos:"^([A-Za-zÑñÁáÉéÍíÓóÚú ]+['\-]{0,1}[A-Za-zÑñÁáÉéÍíÓóÚú ]+)(\s+([A-Za-zÑñÁáÉéÍíÓóÚú ]+['\-]{0,1}[A-Za-zÑñÁáÉéÍíÓóÚú ]+))*$",
    Telefono:"^([0-9]{10})$",
    Telefonolength:10,
    MaxlenghtName: 70,
    MaxlenghtEmail: 60
};